Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL201.h
#define _ECCP1CON_DC1B_POSITION                  0x00000004
#define _ECCP1CON_DC1B_MASK                      0x00000030
#define _ECCP1CON_DC1B_LENGTH                    0x00000002

#define _ECCP1CON_P1M_POSITION                   0x00000006
#define _ECCP1CON_P1M_MASK                       0x000000C0
#define _ECCP1CON_P1M_LENGTH                     0x00000002

#define _ECCP1CON_CCP1M0_POSITION                0x00000000
#define _ECCP1CON_CCP1M0_MASK                    0x00000001
#define _ECCP1CON_CCP1M0_LENGTH                  0x00000001

#define _ECCP1CON_CCP1M1_POSITION                0x00000001
#define _ECCP1CON_CCP1M1_MASK                    0x00000002
#define _ECCP1CON_CCP1M1_LENGTH                  0x00000001

#define _ECCP1CON_CCP1M2_POSITION                0x00000002
#define _ECCP1CON_CCP1M2_MASK                    0x00000004
#define _ECCP1CON_CCP1M2_LENGTH                  0x00000001

#define _ECCP1CON_CCP1M3_POSITION                0x00000003
#define _ECCP1CON_CCP1M3_MASK                    0x00000008
#define _ECCP1CON_CCP1M3_LENGTH                  0x00000001

#define _ECCP1CON_DC1B0_POSITION                 0x00000004
#define _ECCP1CON_DC1B0_MASK                     0x00000010
#define _ECCP1CON_DC1B0_LENGTH                   0x00000001

#define _ECCP1CON_DC1B1_POSITION                 0x00000005
#define _ECCP1CON_DC1B1_MASK                     0x00000020
#define _ECCP1CON_DC1B1_LENGTH                   0x00000001

#define _ECCP1CON_P1M0_POSITION                  0x00000006
#define _ECCP1CON_P1M0_MASK                      0x00000040
#define _ECCP1CON_P1M0_LENGTH                    0x00000001

#define _ECCP1CON_P1M1_POSITION                  0x00000007
#define _ECCP1CON_P1M1_MASK                      0x00000080
#define _ECCP1CON_P1M1_LENGTH                    0x00000001

#define _CCP2CON_CCPM_POSITION                   0x00000000
#define _CCP2CON_CCPM_MASK                       0x0000000F
#define _CCP2CON_CCPM_LENGTH                     0x00000004

#define _CCP2CON_DCB_POSITION                    0x00000004
#define _CCP2CON_DCB_MASK                        0x00000030
#define _CCP2CON_DCB_LENGTH                      0x00000002

#define _CCP2CON_CCPM0_POSITION                  0x00000000
#define _CCP2CON_CCPM0_MASK                      0x00000001
#define _CCP2CON_CCPM0_LENGTH                    0x00000001

#define _CCP2CON_CCPM1_POSITION                  0x00000001
#define _CCP2CON_CCPM1_MASK                      0x00000002
#define _CCP2CON_CCPM1_LENGTH                    0x00000001

#define _CCP2CON_CCPM2_POSITION                  0x00000002
#define _CCP2CON_CCPM2_MASK                      0x00000004
#define _CCP2CON_CCPM2_LENGTH                    0x00000001

#define _CCP2CON_CCPM3_POSITION                  0x00000003
#define _CCP2CON_CCPM3_MASK                      0x00000008
#define _CCP2CON_CCPM3_LENGTH                    0x00000001

#define _CCP2CON_DCB0_POSITION                   0x00000004
#define _CCP2CON_DCB0_MASK                       0x00000010
#define _CCP2CON_DCB0_LENGTH                     0x00000001

#define _CCP2CON_DCB1_POSITION                   0x00000005
#define _CCP2CON_DCB1_MASK                       0x00000020
#define _CCP2CON_DCB1_LENGTH                     0x00000001

#define _CCP2CON_CCP2M_POSITION                  0x00000000
#define _CCP2CON_CCP2M_MASK                      0x0000000F
#define _CCP2CON_CCP2M_LENGTH                    0x00000004

#define _CCP2CON_DC2B_POSITION                   0x00000004
#define _CCP2CON_DC2B_MASK                       0x00000030
#define _CCP2CON_DC2B_LENGTH                     0x00000002

#define _CCP2CON_CCP2M0_POSITION                 0x00000000
#define _CCP2CON_CCP2M0_MASK                     0x00000001
#define _CCP2CON_CCP2M0_LENGTH                   0x00000001

#define _CCP2CON_CCP2M1_POSITION                 0x00000001
#define _CCP2CON_CCP2M1_MASK                     0x00000002
#define _CCP2CON_CCP2M1_LENGTH                   0x00000001

#define _CCP2CON_CCP2M2_POSITION                 0x00000002
#define _CCP2CON_CCP2M2_MASK                     0x00000004
#define _CCP2CON_CCP2M2_LENGTH                   0x00000001

#define _CCP2CON_CCP2M3_POSITION                 0x00000003
#define _CCP2CON_CCP2M3_MASK                     0x00000008
#define _CCP2CON_CCP2M3_LENGTH                   0x00000001

#define _CCP2CON_DC2B0_POSITION                  0x00000004
#define _CCP2CON_DC2B0_MASK                      0x00000010
#define _CCP2CON_DC2B0_LENGTH                    0x00000001

#define _CCP2CON_DC2B1_POSITION                  0x00000005
#define _CCP2CON_DC2B1_MASK                      0x00000020
#define _CCP2CON_DC2B1_LENGTH                    0x00000001

#define _SPI1BUF_SSPBUF_POSITION                 0x00000000
#define _SPI1BUF_SSPBUF_MASK                     0x000000FF
#define _SPI1BUF_SSPBUF_LENGTH                   0x00000008

#define _SPI1BUF_SPI1BUF_POSITION                0x00000000
#define _SPI1BUF_SPI1BUF_MASK                    0x000000FF
#define _SPI1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1BUF_SSPBUF_POSITION                 0x00000000
#define _SSP1BUF_SSPBUF_MASK                     0x000000FF
#define _SSP1BUF_SSPBUF_LENGTH                   0x00000008

#define _SSP1BUF_SPI1BUF_POSITION                0x00000000
#define _SSP1BUF_SPI1BUF_MASK                    0x000000FF
#define _SSP1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1CON1_SSPM_POSITION                  0x00000000
#define _SSP1CON1_SSPM_MASK                      0x0000000F
#define _SSP1CON1_SSPM_LENGTH                    0x00000004

#define _SSP1CON1_CKP_POSITION                   0x00000004
#define _SSP1CON1_CKP_MASK                       0x00000010
#define _SSP1CON1_CKP_LENGTH                     0x00000001

#define _SSP1CON1_SSPEN_POSITION                 0x00000005
#define _SSP1CON1_SSPEN_MASK                     0x00000020
#define _SSP1CON1_SSPEN_LENGTH                   0x00000001

#define _SSP1CON1_SSPOV_POSITION                 0x00000006
#define _SSP1CON1_SSPOV_MASK                     0x00000040
#define _SSP1CON1_SSPOV_LENGTH                   0x00000001

#define _SSP1CON1_WCOL_POSITION                  0x00000007
#define _SSP1CON1_WCOL_MASK                      0x00000080
#define _SSP1CON1_WCOL_LENGTH                    0x00000001

#define _SSP1CON1_SSPM0_POSITION                 0x00000000
#define _SSP1CON1_SSPM0_MASK                     0x00000001
#define _SSP1CON1_SSPM0_LENGTH                   0x00000001

